function code = codegen_B1I(n)
% 生成北斗B1I测距码
% 输入卫星序号n，输出测距码序列code

phase = [1,3;1,4;1,5;1,6;1,8;1,9;1,10;1,11;2,7;3,4;3,5;3,6;3,8;3,9;
    3,10;3,11;4,5;4,6;4,8;4,9;4,10;4,11;5,6;5,8;5,9;5,10;5,11;6,8;
    6,9;6,10;6,11;8,9;8,10;8,11;9,10;9,11;10,11];
p1 = phase(n,1);
p2 = phase(n,2);
G1 = [1,-1,1,-1,1,-1,1,-1,1,-1,1];
G2 = G1;
length = 2046;
code = zeros(1,length);
for i=1:length
    code(i) = G2(p1)*G2(p2)*G1(11);  %测距码生成
    
    %G1码序列迭代生成
    tmp1 = G1(1)*G1(7)*G1(8)*G1(9)*G1(10)*G1(11);
    G1(2:11) = G1(1:10);
    G1(1) = tmp1;
    
    %G2码序列迭代生成
    tmp2 = G2(1)*G2(2)*G2(3)*G2(4)*G2(5)*G2(8)*G2(9)*G2(11);
    G2(2:11) = G2(1:10);
    G2(1) = tmp2;
end    
code = (-1) * code;